Revit 2027 API
TaskDialog.Show Method
 Shows the task dialog.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TaskDialogResult Show()
Public Function Show As TaskDialogResult
public:
TaskDialogResult Show()
member Show : unit -> TaskDialogResult
Return Value
TaskDialogResult
 The user's response to the task dialog.
Exceptions
Exception | Condition
InvalidOperationException | Thrown when the task dialog is shown out of main thread of Revit or when an extra checkbox and a verification checkbox are enabled at the same time.
See Also
Reference
TaskDialog Class
Show Overload
Autodesk.Revit.UI Namespace